{
  "headers": [
    {
      "name": "Content-Security-Policy",
      "basic": "Prevents XSS by restricting sources of scripts and other content.",
      "weight": 3,
      "context": "A strong CSP is one of the most effective defenses against XSS and data injection attacks. It tells browsers what content is allowed to load, reducing the risk of malicious scripts running on your site. Missing or weak CSP leaves your users vulnerable to a wide range of attacks."
    },
    {
      "name": "Strict-Transport-Security",
      "basic": "Forces browsers to use HTTPS, protecting against protocol downgrade attacks.",
      "weight": 3,
      "context": "HSTS ensures all future requests use HTTPS, even if a user types http://. This prevents attackers from intercepting or modifying traffic via downgrade or SSL-stripping attacks. Essential for any site with authentication or sensitive data."
    },
    {
      "name": "X-Content-Type-Options",
      "basic": "Prevents MIME-sniffing, reducing exposure to drive-by downloads and XSS.",
      "weight": 2,
      "context": "Without this header, browsers may try to guess the content type, which can lead to security issues if a file is interpreted as something else (e.g., a script). Always set to 'nosniff'."
    },
    {
      "name": "X-Frame-Options",
      "basic": "Prevents clickjacking by disallowing your site to be framed by others.",
      "weight": 2,
      "context": "Clickjacking attacks trick users into clicking on something different from what they perceive. This header blocks your site from being embedded in iframes on other domains."
    },
    {
      "name": "Referrer-Policy",
      "basic": "Controls how much referrer information is sent with requests, reducing info leakage.",
      "weight": 1,
      "context": "A strict referrer policy prevents sensitive URLs or data from leaking to third parties via the Referer header. Important for privacy and to avoid leaking internal paths."
    },
    {
      "name": "Permissions-Policy",
      "basic": "Restricts use of powerful browser features (camera, mic, etc.) to trusted origins.",
      "weight": 1,
      "context": "This header lets you control which origins can use features like geolocation, camera, microphone, and more. Reduces attack surface and enforces least privilege."
    },
    {
      "name": "Cache-Control",
      "basic": "Controls browser and proxy caching, important for sensitive data.",
      "weight": 1,
      "context": "Improper caching can expose sensitive data to unauthorized users. Use strict cache settings for authenticated or sensitive content."
    },
    {
      "name": "Access-Control-Allow-Origin",
      "basic": "Controls which domains can access resources via CORS. Important for APIs.",
      "weight": 1,
      "context": "CORS headers are critical for APIs and web apps that share resources across origins. Misconfiguration can lead to data leaks or unauthorized access."
    }
  ]
} 